### 원소/요소 데이터 변경하기

In [1]:
# 모듈로딩
import pandas as pd

In [2]:
# 데이터 준비
data={'name':['홍길동', '마징가', '원더우먼'],
       'job':['의적','로봇', '영웅'],
       'gender':['남','남','여'],
       'age':[100, 200, 300],
       'height':[180,300,200]}

In [12]:
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

### 원소/요소 값 변경하기

In [16]:
## 홍길동의 성별을 '남' ---> '여'
dataDF.iloc[0,2], dataDF.loc[0]['gender']

('남', '남')

In [18]:
# 불러온 값 변경하기
dataDF.iloc[0,2]='여'
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [19]:
## 원더우먼 직업을 직장인으로 변경
dataDF.iloc[2,1]='직장인'
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

- [행 전체 값 변경]
# 행 전체 선택 -> 변수명.iloc[]  or  변수명.loc[]

In [20]:
# 1번행 추출하고싶음
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [21]:
# 1번행 값 변경 => 컬럼수 == 데이터 개수
dataDF.iloc[1]=['마징가2', '영웅', '여', 90, 170]
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1  마징가2   영웅      여   90     170
2  원더우먼  직장인      여  300     200

In [22]:
# 1번행 값 변경 => 1개 == 데이터 개수
dataDF.iloc[1]=0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1     0    0      0    0       0
2  원더우먼  직장인      여  300     200

In [23]:
dataDF.height = 0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100       0
1     0    0      0    0       0
2  원더우먼  직장인      여  300       0

: